# Part 1

General Overview:

1. Understand the shape of the data
2. Data Exploration
3. Data Cleaning
4. Data Preprocessing for Model

In [79]:
import numpy as np
import pandas as pd
import re
import calendar

import seaborn as sns
import matplotlib.style as style

import matplotlib as mpl
import matplotlib.pyplot as plt
import matplotlib.cm as cm
%matplotlib inline

style.use('fivethirtyeight')

In [80]:
# Data Scientists Job Postings
a = pd.read_csv('outputs/job_postings_data_scientist_Atlanta, GA.csv')
b = pd.read_csv('outputs/job_postings_data_scientist_Austin, TX.csv')
c = pd.read_csv('outputs/job_postings_data_scientist_Baltimore, MD.csv')
d = pd.read_csv('outputs/job_postings_data_scientist_Boston, MA.csv')
e = pd.read_csv('outputs/job_postings_data_scientist_Boulder, CO.csv')
f = pd.read_csv('outputs/job_postings_data_scientist_Charlotte, NC.csv')
g = pd.read_csv('outputs/job_postings_data_scientist_Colorado Springs, CO.csv')
h = pd.read_csv('outputs/job_postings_data_scientist_Columbus, OH.csv')
i = pd.read_csv('outputs/job_postings_data_scientist_Dallas, TX.csv')
j = pd.read_csv('outputs/job_postings_data_scientist_Denver, CO.csv')
k = pd.read_csv('outputs/job_postings_data_scientist_Durham, NC.csv')
l = pd.read_csv('outputs/job_postings_data_scientist_Hayward, CA.csv')
m = pd.read_csv('outputs/job_postings_data_scientist_Houston, TX.csv')
n = pd.read_csv('outputs/job_postings_data_scientist_Huntsville, AL.csv')
o = pd.read_csv('outputs/job_postings_data_scientist_Los Angeles, CA.csv')
p = pd.read_csv('outputs/job_postings_data_scientist_Madison, WI.csv')
q = pd.read_csv('outputs/job_postings_data_scientist_New York, NY.csv')
r = pd.read_csv('outputs/job_postings_data_scientist_Oakland, CA.csv')
s = pd.read_csv('outputs/job_postings_data_scientist_Raleigh, NC.csv')
t = pd.read_csv('outputs/job_postings_data_scientist_San Diego, CA.csv')
u = pd.read_csv('outputs/job_postings_data_scientist_San Francisco.csv')
v = pd.read_csv('outputs/job_postings_data_scientist_San Jose, CA.csv')
w = pd.read_csv('outputs/job_postings_data_scientist_Santa Clara, CA.csv')
x = pd.read_csv('outputs/job_postings_data_scientist_Seattle, WA.csv')
y = pd.read_csv('outputs/job_postings_data_scientist_Sunnyvale, CA.csv')
z = pd.read_csv('outputs/job_postings_data_scientist_Trenton, NJ.csv')
alfa = pd.read_csv('outputs/job_postings_data_scientist_Washington, D.C..csv')
beta = pd.read_csv('outputs/job_postings_data_scientist_all_cities.csv')
gamma = pd.read_csv('outputs/job_postings_data_scientist_sf.csv')

In [81]:
arr = [a,b,c,d,e,f,g,h,i,j,k,l,m,n,o,p,q,e,s,t,u,v,w,x,y,z,alfa, beta, gamma]
df_1 = pd.concat(arr)

In [82]:
# Data Analyst Job Postings
a = pd.read_csv('outputs_2/job_postings_data_analyst_Atlanta, GA.csv')
b = pd.read_csv('outputs_2/job_postings_data_analyst_Austin, TX.csv')
c = pd.read_csv('outputs_2/job_postings_data_analyst_Baltimore, MD.csv')
d = pd.read_csv('outputs_2/job_postings_data_analyst_Boston, MA.csv')
e = pd.read_csv('outputs_2/job_postings_data_analyst_Boulder, CO.csv')
f = pd.read_csv('outputs_2/job_postings_data_analyst_Charlotte, NC.csv')
g = pd.read_csv('outputs_2/job_postings_data_analyst_Colorado Springs, CO.csv')
h = pd.read_csv('outputs_2/job_postings_data_analyst_Columbus, OH.csv')
i = pd.read_csv('outputs_2/job_postings_data_analyst_Dallas, TX.csv')
j = pd.read_csv('outputs_2/job_postings_data_analyst_Denver, CO.csv')
k = pd.read_csv('outputs_2/job_postings_data_analyst_Durham, NC.csv')
l = pd.read_csv('outputs_2/job_postings_data_analyst_Hayward, CA.csv')
m = pd.read_csv('outputs_2/job_postings_data_analyst_Houston, TX.csv')
n = pd.read_csv('outputs_2/job_postings_data_analyst_Huntsville, AL.csv')
o = pd.read_csv('outputs_2/job_postings_data_analyst_Los Angeles, CA.csv')
p = pd.read_csv('outputs_2/job_postings_data_analyst_Madison, WI.csv')
q = pd.read_csv('outputs_2/job_postings_data_analyst_New York, NY.csv')
r = pd.read_csv('outputs_2/job_postings_data_analyst_Oakland, CA.csv')
s = pd.read_csv('outputs_2/job_postings_data_analyst_Raleigh, NC.csv')
t = pd.read_csv('outputs_2/job_postings_data_analyst_San Diego, CA.csv')
u = pd.read_csv('outputs_2/job_postings_data_analyst_San Francisco.csv')
v = pd.read_csv('outputs_2/job_postings_data_analyst_San Jose, CA.csv')
w = pd.read_csv('outputs_2/job_postings_data_analyst_Santa Clara, CA.csv')
x = pd.read_csv('outputs_2/job_postings_data_analyst_Seattle, WA.csv')
y = pd.read_csv('outputs_2/job_postings_data_analyst_Sunnyvale, CA.csv')
z = pd.read_csv('outputs_2/job_postings_data_analyst_Trenton, NJ.csv')
alfa = pd.read_csv('outputs_2/job_postings_data_analyst_Washington, D.C..csv')

In [83]:
arr = [a,b,c,d,e,f,g,h,i,j,k,l,m,n,o,p,q,e,s,t,u,v,w,x,y,z,alfa]
df_2 = pd.concat(arr)

In [84]:
temp = [df_1, df_2]
df = pd.concat(temp)

## 1. Understanding the shape of the data

In [85]:
def getting_to_know(df, question=None):
    display(df.shape)
    display(df.columns)
    if question == 'y':
        display(df.head())
        display(df.tail())
    print('--------------------------END--------------------------------')
getting_to_know(df)

(16038, 10)

Index(['job_title', 'salary', 'company', 'location', 'is_remote', 'job_rating',
       'job_summary', 'post_date', 'extract_date', 'job_url'],
      dtype='object')

--------------------------END--------------------------------

In [86]:
# Missing values
def missing_values_func(df):
    """
    @author: Cristobal Zamorano Astudillo
    
    Personalize Missing Data Function
    
    Paramaters
    ----------
    df : DataFrame of interest
    
    Returns
    -------
    A string with counting all the features of the input DataFrame. If some values are missing, then 
    function will return a DataFrame with the following:
    - Index as the features with the missing values
    - A `Missing Values Count` Feature that tells the exact number of rows that has a misssing value in that feature index.
    - A `% of Total Values` that tells how much are the missing values of that feature with respect to the other missing values.
    """
    
    # Total missing values
    mis_val = df.isnull().sum()

    # Percentage of missing values
    mis_val_percent = 100 * df.isnull().sum() / len(df)

    # Make a table with the results
    mis_val_table = pd.concat([mis_val, mis_val_percent], axis=1)

    # Rename the columns
    mis_val_table_ren_columns = mis_val_table.rename(
        columns = {0 : 'Missing Values Count', 1 : '% of Total Values'})

    # Sort the table by percentage of missing descending
    mis_val_table_ren_columns = mis_val_table_ren_columns[
        mis_val_table_ren_columns.iloc[:,1] != 0].sort_values(
    '% of Total Values', ascending=False).round(1)


    # Returns
    if mis_val_table_ren_columns.empty:
        return f'Your selected dataframe has  {df.shape[1]} features. There are  {mis_val_table_ren_columns.shape[0]} features that have missing values.'
    else:
        display(mis_val_table_ren_columns.style.background_gradient(cmap='Reds'))
        return f'Your selected dataframe has  {df.shape[1]} features. There are  {mis_val_table_ren_columns.shape[0]} features that have missing values.'
        
missing_values_func(df)

'Your selected dataframe has  10 features. There are  4 features that have missing values.'

In [87]:
df['job_title'].value_counts()

Data Scientist                                   961
Business Analyst                                 504
Data Analyst                                     485
Senior Data Scientist                            344
Senior Data Analyst                              238
                                                ...
Business Analyst: : USA residents only             1
Sr. Business Intelligence Analyst - Developer      1
Sr./Staff Engineer - Deep Learning and HCI         1
Master Production Scheduler/Business Analyst       1
Pharmaceutical Data Analyst                        1
Name: job_title, Length: 5502, dtype: int64

In [88]:
df['salary'].value_counts()

$77.55 - $82.55 an hour       37
$60 - $70 an hour             31
$250,000 a year               22
$126,000 - $165,000 a year    22
$60,000 - $80,000 a year      22
                              ..
$57,000 - $70,000 a year       1
$77,931 - $120,475 a year      1
Up to $80,000 a year           1
$125,000 - $180,000 a year     1
$107,000 - $124,000 a year     1
Name: salary, Length: 585, dtype: int64

In [89]:
df['is_remote'].value_counts()

Remote                1297
Temporarily remote     843
Name: is_remote, dtype: int64

In [90]:
df.columns

Index(['job_title', 'salary', 'company', 'location', 'is_remote', 'job_rating',
       'job_summary', 'post_date', 'extract_date', 'job_url'],
      dtype='object')

## 2. Data Cleaning

### Duplicates

Drop the duplicate jobs by using their link.

In [91]:
df.drop_duplicates(subset='job_url', keep = 'first', inplace = True)

In [92]:
getting_to_know(df)

(9966, 10)

Index(['job_title', 'salary', 'company', 'location', 'is_remote', 'job_rating',
       'job_summary', 'post_date', 'extract_date', 'job_url'],
      dtype='object')

--------------------------END--------------------------------

### Location

In [93]:
df['location'].value_counts().index.to_list()

['New York, NY',
 'San Francisco, CA',
 'Atlanta, GA',
 'Seattle, WA',
 'Washington, DC',
 'Boston, MA',
 'Austin, TX',
 'Dallas, TX',
 'Houston, TX',
 'San Jose, CA',
 'San Diego, CA',
 'Los Angeles, CA',
 'Santa Clara, CA',
 'Raleigh, NC',
 'Menlo Park, CA',
 'Mountain View, CA',
 'Palo Alto, CA',
 'Charlotte, NC',
 'Denver, CO',
 'Columbus, OH',
 'Santa Clara Valley, CA',
 'Baltimore, MD',
 'Arlington, VA',
 'Cambridge, MA',
 'Durham, NC',
 'Sunnyvale, CA',
 'Plano, TX',
 'Oakland, CA',
 'Irving, TX',
 'Redwood City, CA',
 'Princeton, NJ',
 'Fort Meade, MD',
 'McLean, VA',
 'United States',
 'Bellevue, WA',
 'Redmond, WA',
 'Columbia, MD',
 'Fremont, CA',
 'Huntsville, AL',
 'Madison, WI',
 'California',
 'San Mateo, CA',
 'Alpharetta, GA',
 'San Francisco Bay Area, CA',
 'Boulder, CO',
 'Colorado Springs, CO',
 'Santa Monica, CA',
 'Morrisville, NC',
 'Alexandria, VA',
 'South San Francisco, CA',
 'Walnut Creek, CA',
 'Jersey City, NJ',
 'Cary, NC',
 'Manhattan, NY',
 'Herndon, VA',
 'Pleasanton, CA',
 'Rockville, MD',
 'Annapolis Junction, MD',
 'Brooklyn, NY',
 'Foster City, CA',
 'Cupertino, CA',
 'Chantilly, VA',
 'Reston, VA',
 'San Ramon, CA',
 'Richardson, TX',
 'Research Triangle Park, NC',
 'Gaithersburg, MD',
 'El Segundo, CA',
 'Laurel, MD',
 'Long Island City, NY',
 'Waltham, MA',
 'Somerville, MA',
 'Woodland Hills, CA',
 'Somerset, NJ',
 'Springfield, VA',
 'Milpitas, CA',
 'Horsham, PA',
 'Newark, NJ',
 'San Carlos, CA',
 'Fairfax, VA',
 'Burbank, CA',
 'Newark, CA',
 'Lexington, MA',
 'Emeryville, CA',
 'Berkeley, CA',
 'Dublin, OH',
 'Parsippany, NJ',
 'Glendale, CA',
 'Englewood, CO',
 'Bethesda, MD',
 'Annapolis, MD',
 'Falls Church, VA',
 'Broomfield, CO',
 'Lewisville, TX',
 'Livermore, CA',
 'Queens, NY',
 'Golden, CO',
 'Norcross, GA',
 'Stanford, CA',
 'Long Beach, CA',
 'East Palo Alto, CA',
 'Frisco, TX',
 'Bothell, WA',
 'Westerville, OH',
 'Pasadena, CA',
 'Patuxent River Estates, MD',
 'Culver City, CA',
 'Tysons, VA',
 'New Brunswick, NJ',
 'Brea, CA',
 'Vienna, VA',
 'Everett, WA',
 'Alameda, CA',
 'Burlingame, CA',
 'Richmond, CA',
 'Cypress, CA',
 'Duluth, GA',
 'Silicon Valley, CA',
 'Secaucus, NJ',
 'Edison, NJ',
 'Hunt Valley, MD',
 'Owings Mills, MD',
 'Torrance, CA',
 'Compton, CA',
 'Burlington, MA',
 'Los Gatos, CA',
 'Los Altos, CA',
 'Florham Park, NJ',
 'Aurora, CO',
 'Westminster, CO',
 'Hoboken, NJ',
 'Berkeley Heights, NJ',
 'Plainsboro, NJ',
 'Timonium, MD',
 'Kirkland, WA',
 'Philadelphia, PA',
 'Framingham, MA',
 'Sterling, VA',
 'Chapel Hill, NC',
 'Chatsworth, CA',
 'Coppell, TX',
 'San Bruno, CA',
 'Renton, WA',
 'Bedford, MA',
 'Cerritos, CA',
 'Dunwoody, GA',
 'Northridge, CA',
 'Suitland, MD',
 'Fort Belvoir, VA',
 'Fullerton, CA',
 'Linthicum, MD',
 'Livingston, NJ',
 'Pennington, NJ',
 'Stafford, TX',
 'Arlington, TX',
 'Cranbury, NJ',
 'East Hanover, NJ',
 'Monmouth Junction, NJ',
 'Iselin, NJ',
 'Cherry Hill, NJ',
 'Mount Laurel, NJ',
 'San Rafael, CA',
 'New Jersey',
 'Deer Park, TX',
 'Fort Worth, TX',
 'Allen, TX',
 'Davidson, NC',
 'Texas',
 'Middleton, WI',
 'Lakewood, CO',
 'Chevy Chase, MD',
 'Titusville, NJ',
 'Township of Hamilton, NJ',
 'Tysons Corner, VA',
 'Wilmington, MA',
 'Carrollton, TX',
 'Silver Spring, MD',
 'Bronx, NY',
 'Dublin, CA',
 'Fort Mill, SC',
 'Addison, TX',
 'Hanover, MD',
 'Englewood Cliffs, NJ',
 'Tucker, GA',
 'Newton, MA',
 'Gardena, CA',
 'Franklin Lakes, NJ',
 'South Plainfield, NJ',
 'Tacoma, WA',
 'Woburn, MA',
 'La Jolla, CA',
 'Quincy, MA',
 'Dallas-Fort Worth, TX',
 'Manhattan Beach, CA',
 'Union City, CA',
 'Needham, MA',
 'Moorestown, NJ',
 'Commerce, CA',
 'Wellesley, MA',
 'Buena Park, CA',
 'Greenwood Village, CO',
 'Louisville, CO',
 'Whippany, NJ',
 'Anaheim, CA',
 'Alhambra, CA',
 'Southlake, TX',
 'Watertown, MA',
 'College Park, MD',
 'Trenton, NJ',
 'Dulles, VA',
 'Poway, CA',
 'Pearland, TX',
 'Flower Mound, TX',
 'Round Rock, TX',
 'Beverly, MA',
 'Peachtree Corners, GA',
 'Charlestown, MA',
 'Woodlawn, MD',
 'Arlington County, VA',
 'Littleton, CO',
 'Hayward, CA',
 'Roswell, GA',
 'Linthicum Heights, MD',
 'Bowie, MD',
 'Campbell, CA',
 'Irwindale, CA',
 'Brighton, MA',
 'Weston, MA',
 'Hackensack, NJ',
 'Manhasset, NY',
 'La Ca√±ada Flintridge, CA',
 'Weehawken, NJ',
 'Hillsborough, NC',
 'Marina del Rey, CA',
 'East Brunswick, NJ',
 'Ridgefield Park, NJ',
 'Beltsville, MD',
 'Woodcliff Lake, NJ',
 'Dallas County, TX',
 'Jericho, NY',
 'Pasadena, TX',
 'Elkridge, MD',
 'Danvers, MA',
 'Duarte, CA',
 'Cottage Grove, WI',
 'College Point, NY',
 'Yardley, PA',
 'Fairfield, NJ',
 'Roseland, NJ',
 'Mooresville, NC',
 'West Menlo Park, CA',
 'Marlton, NJ',
 'Woodbridge, NJ',
 'Short Hills, NJ',
 'Carle Place, NY',
 'Longmont, CO',
 'Towson, MD',
 'Germantown, MD',
 'Lake Success, NY',
 'Redondo Beach, CA',
 'Applewood, CO',
 'Flushing, NY',
 'Wake County, NC',
 'Venice, CA',
 'Catonsville, MD',
 'Centennial, CO',
 'Peterson AFB, CO',
 'Las Colinas, TX',
 'Lowell, MA',
 'New Providence, NJ',
 'Katy, TX',
 'Industry, CA',
 'Dane County, WI',
 'Lanham, MD',
 'Tukwila, WA',
 'Cardiff-by-the-Sea, CA',
 'North Quincy, MA',
 'Kent, WA',
 'Elkins Park, PA',
 'White Plains, NY',
 'Redstone Arsenal, AL',
 'Kendall Park, NJ',
 'Matawan, NJ',
 'West Hollywood, CA',
 'Sylmar, CA',
 'Garden City, NY',
 'Newtown, PA',
 'Lyndhurst, NJ',
 'Smyrna, GA',
 'Greenbelt, MD',
 'Edgewater Park, NJ',
 'Monrovia, CA',
 'Lorton, VA',
 'Arlington, MA',
 'Bellaire, TX',
 'Novato, CA',
 'Langhorne, PA',
 'Reynoldsburg, OH',
 'Valley Stream, NY',
 'Puget Sound, WA',
 'Decatur, AL',
 'Marietta, GA',
 'Belmont, CA',
 'Summit, NJ',
 'Windsor Mill, MD',
 'Andover, MA',
 'Holly Springs, NC',
 'Stone Mountain, GA',
 'North Reading, MA',
 'Trevose, PA',
 'Decatur, GA',
 'Spring, TX',
 'Township of South Brunswick, NJ',
 'New Hyde Park, NY',
 'Hyattsville, MD',
 'Doraville, GA',
 'Wayne, NJ',
 'Johns Creek, GA',
 'Kearny Mesa, CA',
 'Diamond Bar, CA',
 'Branchburg, NJ',
 'Somerville, NJ',
 'East Windsor, NJ',
 'North Arlington, NJ',
 'Gwynn Oak, MD',
 'Kenilworth, NJ',
 'Rosemead, CA',
 'Orangeburg, NY',
 'Rosslyn, VA',
 'Teaneck, NJ',
 'Grand Prairie, TX',
 'Peabody, MA',
 'Port Washington, NY',
 'Issaquah, WA',
 'Morrisville, PA',
 'Ashburn, VA',
 'Yonkers, NY',
 'Cockeysville, MD',
 'Kingwood, TX',
 'Montvale, NJ',
 'Coronado, CA',
 'Natick, MA',
 'Thornton, CO',
 'Chalfont, PA',
 'Bremerton, WA',
 'North Brunswick, NJ',
 'Seal Beach, CA',
 'Sandy Springs, GA',
 'DeKalb County, GA',
 'Fulton, MD',
 'Adelphi, MD',
 'La Mirada, CA',
 'Encinitas, CA',
 'Jefferson County, CO',
 'Elizabeth, NJ',
 'Olney, MD',
 'Jackson Heights, NY',
 'West Falls Church, VA',
 'Garner, NC',
 'Union, NJ',
 'Cheverly, MD',
 'Maynard, MA',
 'Marlborough, MA',
 'Dominguez, CA',
 'Hicksville, NY',
 'Stoneham, MA',
 'Concord, CA',
 'Lynnfield, MA',
 'Tribeca, NY',
 'Belcamp, MD',
 'Norwell, MA',
 'Ewing, NJ',
 'Indian Head, MD',
 'Westwood, MA',
 'Washington Navy Yard, DC',
 'Manhattanville, NY',
 'Foxborough, MA',
 'Middleton, MA',
 'Rutherford, NJ',
 'National City, CA',
 'Great Neck, NY',
 'Fair Lawn, NJ',
 'South Easton, MA',
 'Whittier, CA',
 'Lewis Center, OH',
 'Webster, TX',
 'Powell, OH',
 'Weymouth, MA',
 'Whitestone, NY',
 'Pikesville, MD',
 'Aberdeen Proving Ground, MD',
 'Madison, AL',
 'Raleigh-Durham, NC',
 'Belmont, NC',
 'Lynnwood, WA',
 'Medford, NJ',
 'Township of Franklin, NJ',
 'Hanover, NJ',
 'Playa Vista, CA',
 'Vallejo, CA',
 'Woodmere, NY',
 'Brookline, MA',
 'Kearny, NJ',
 'Rex, GA',
 'Malden, MA',
 'East Meadow, NY',
 'Millbrae, CA',
 'Fort George G Meade, MD',
 'Abington, PA',
 'San Gabriel Valley, CA',
 'Ellicott City, MD',
 'Hawthorne, CA',
 'Farmers Branch, TX',
 'Teterboro, NJ',
 'Crystal City, VA',
 'Troy Hills, NJ',
 'Bayonne, NJ',
 'Maurer, NJ',
 'Santa Cruz County, CA',
 'Millersville, MD',
 'Pennsauken, NJ',
 'Andrews AFB, MD',
 'Spring Valley, CA',
 'Mill Creek, WA',
 'Moffett Field, CA',
 'Gahanna, OH',
 'Century City, CA',
 'Huntersville, NC',
 'Sun Prairie, WI',
 'Rockwall, TX',
 'Haworth, NJ',
 'Half Moon Bay, CA',
 'Indian Land, SC',
 'Azusa, CA',
 'Wilmer, TX',
 'Princeton Junction, NJ',
 'Orange, CA',
 'Studio City, CA',
 'Capitol Hill, WA',
 'Harrison, NY',
 'Chula Vista, CA',
 'Lumberton, NJ',
 'SoHo, NY',
 'Jamesburg, NJ',
 'Fort Washington, MD',
 'Apex, NC',
 'Fort Washington, PA',
 'Everett, MA',
 'Mooresville, AL',
 'Milton, MA',
 'Rockland, MA',
 'Uniondale, NY',
 'Severna Park, MD',
 'La Porte, TX',
 'Schriever AFB, CO',
 'Montgomery County, MD',
 'DeForest, WI',
 'La Puente, CA',
 'Manchester, MA',
 'Westbury, NY',
 'Jessup, MD',
 'Sherman Oaks, CA',
 'Lawrenceville, NJ',
 'Santa Fe Springs, CA',
 'Staten Island, NY',
 'Rego Park, NY',
 'Alabama',
 'Lone Tree, CO',
 'Los Angeles County, CA',
 'Carlstadt, NJ',
 'Metuchen, NJ',
 'Pflugerville, TX',
 'Nottingham, MD',
 'Kentfield, CA',
 'Hurst, TX',
 'Takoma Park, MD',
 'Little Ferry, NJ',
 'Leander, TX',
 'Paramus, NJ',
 'Downey, CA',
 'Concord, NC',
 'Highlands Ranch, CO',
 'Elmwood Park, NJ',
 'Glen Echo, MD',
 'Elmhurst, NY',
 'Lawrenceville, GA',
 'Walnut, CA',
 'Hopewell, NJ',
 'Norwood, MA',
 'Grapevine, TX',
 'Sammamish, WA',
 'Dedham, MA',
 'New Albany, OH',
 'Dobbs Ferry, NY',
 'Port Reading, NJ',
 'Kennesaw, GA',
 'West Windsor, NJ',
 'Auburn, WA',
 'San Dimas, CA',
 'Skillman, NJ',
 'Clark, NJ',
 'Sugar Land, TX',
 'Santa Cruz, CA',
 'Westford, MA',
 'Lafayette, CO',
 'Centreville, VA',
 'Gwinnett County, GA',
 'Clinton, MD',
 'Fort Lee, NJ',
 'Dorchester, MA',
 'Pentagon, DC',
 'Totowa, NJ',
 'Concord, MA',
 'San Leandro, CA',
 'Browns Mills, NJ',
 'Brisbane, CA',
 'Edgewood, MD',
 'Grove City, OH',
 'Keyport, WA',
 'Chelsea, MA',
 'Flemington, NJ',
 'Tarzana, CA',
 'Ambler, PA',
 'Foggy Bottom, DC',
 'Doylestown, PA']

In [94]:
df[df['location'] == 'Alabama']

,job_title,salary,company,location,is_remote,job_rating,job_summary,post_date,extract_date,job_url
15,Deep Learning Engineer,NaN,Numerator,Alabama,NaN,3.6,Demonstrated ability to drive selection of mac...,19 days ago,2021-01-10,https://www.indeed.com/pagead/clk?mo=r&ad=-6NY...

In [95]:
df[df['location'] == 'Texas']

,job_title,salary,company,location,is_remote,job_rating,job_summary,post_date,extract_date,job_url
37,Looking for Experienced Business Analyst/Softw...,$35 - $38 an hour,Agama Solutions,Texas,NaN,3.8,"Analyze science, engineering, business, and ot...",30+ days ago,2021-01-11,https://www.indeed.com/pagead/clk?mo=r&ad=-6NY...
113,Looking for Experienced Business Analyst/Softw...,$35 - $38 an hour,Agama Solutions,Texas,NaN,3.8,"Analyze science, engineering, business, and ot...",30+ days ago,2021-01-11,https://www.indeed.com/pagead/clk?mo=r&ad=-6NY...
159,Looking for Experienced Business Analyst/Softw...,$35 - $38 an hour,Agama Solutions,Texas,NaN,3.8,"Analyze science, engineering, business, and ot...",30+ days ago,2021-01-11,https://www.indeed.com/pagead/clk?mo=r&ad=-6NY...
326,Looking for Experienced Business Analyst/Softw...,$35 - $38 an hour,Agama Solutions,Texas,NaN,3.8,"Analyze science, engineering, business, and ot...",30+ days ago,2021-01-11,https://www.indeed.com/pagead/clk?mo=r&ad=-6NY...
386,Looking for Experienced Business Analyst/Softw...,$35 - $38 an hour,Agama Solutions,Texas,NaN,3.8,"Analyze science, engineering, business, and ot...",30+ days ago,2021-01-11,https://www.indeed.com/pagead/clk?mo=r&ad=-6NY...

In [96]:
df[df['location'] == 'New Jersey']

,job_title,salary,company,location,is_remote,job_rating,job_summary,post_date,extract_date,job_url
16,Sr. Data Analyst,NaN,Pitney Bowes,New Jersey,NaN,3.6,"Oversees development, execution and continuati...",6 days ago,2021-01-10,https://www.indeed.com/pagead/clk?mo=r&ad=-6NY...
42,Looking for Experienced Business Analyst/Softw...,$35 - $38 an hour,Agama Solutions,New Jersey,NaN,3.8,"Analyze science, engineering, business, and ot...",30+ days ago,2021-01-11,https://www.indeed.com/pagead/clk?mo=r&ad=-6NY...
55,Looking for Experienced Business Analyst/Softw...,$35 - $38 an hour,Agama Solutions,New Jersey,NaN,3.8,"Analyze science, engineering, business, and ot...",30+ days ago,2021-01-11,https://www.indeed.com/pagead/clk?mo=r&ad=-6NY...
87,Looking for Experienced Business Analyst/Softw...,$35 - $38 an hour,Agama Solutions,New Jersey,NaN,3.8,"Analyze science, engineering, business, and ot...",30+ days ago,2021-01-11,https://www.indeed.com/pagead/clk?mo=r&ad=-6NY...
102,Looking for Experienced Business Analyst/Softw...,$35 - $38 an hour,Agama Solutions,New Jersey,NaN,3.8,"Analyze science, engineering, business, and ot...",30+ days ago,2021-01-11,https://www.indeed.com/pagead/clk?mo=r&ad=-6NY...
133,Looking for Experienced Business Analyst/Softw...,$35 - $38 an hour,Agama Solutions,New Jersey,NaN,3.8,"Analyze science, engineering, business, and ot...",30+ days ago,2021-01-11,https://www.indeed.com/pagead/clk?mo=r&ad=-6NY...

Only one job is located in 'Alabama'

### Salary

In [97]:
df['salary'].value_counts()

$77.55 - $82.55 an hour       37
$60 - $70 an hour             25
$250,000 a year               22
$126,000 - $165,000 a year    22
$85,225 - $135,355 a year     18
                              ..
$87,198 - $113,362 a year      1
$64,214 - $121,425 a year      1
$60,000 - $75,000 a year       1
$3,763 - $6,149 a month        1
$4,301 - $7,040 a month        1
Name: salary, Length: 585, dtype: int64

In [74]:
df['salary'].unique()

array([nan, 'Up to $120,000 a year', '$60 - $80 an hour',
       '$35 - $50 an hour', '$92,000 - $108,000 a year',
       '$60 - $100 an hour', '$68,000 - $80,000 a year',
       '$100,000 - $135,000 a year', '$53,828 - $91,507 a year',
       '$65 - $80 an hour', '$90,000 - $135,000 a year',
       '$85,000 - $95,000 a year', '$1,350 a week',
       '$100,000 - $155,000 a year', '$126,000 - $165,000 a year',
       '$70,000 - $92,000 a year', '$53,917 - $120,874 a year',
       'From $96,542 a year', '$35 an hour', '$89,000 - $118,000 a year',
       '$82,988 - $90,015 a year', '$157,000 - $191,000 a year',
       '$100,000 - $120,000 a year', '$102,663 - $157,709 a year',
       '$115,000 a year', '$72,351 - $90,157 a year',
       '$103,690 - $134,798 a year', '$87,198 - $134,798 a year',
       '$121,316 - $157,709 a year', '$96,102 - $200,458 a year',
       '$52,495 - $72,000 a year', '$55,000 - $60,000 a year',
       '$40 per class', '$90,000 - $120,000 a year', '$44 - $48 an hour',
       '$120,000 - $145,000 a year', '$100,000 - $150,000 a year',
       '$71,987 - $133,382 a year', '$45 an hour', '$225,000 a year',
       '$180,000 a year', '$70,000 - $85,000 a year',
       '$100,000 - $140,000 a year', '$100,000 - $200,000 a year',
       '$80,000 - $120,000 a year', '$170,000 a year', '$106,700 a year',
       '$125,000 - $170,000 a year', '$90,000 - $112,000 a year',
       '$80,000 - $89,000 a year', '$62,400 a year',
       '$90,000 - $110,000 a year', '$75,000 - $95,000 a year',
       '$78,670 - $98,337 a year', '$85,000 - $120,000 a year',
       '$80,000 - $100,000 a year', '$60,000 - $75,000 a year',
       '$100,000 a year', '$71,360 a year', '$100,000 - $137,000 a year',
       '$39,600 - $63,500 a year', '$73,900 - $133,100 a year',
       '$102,000 - $140,000 a year', 'From $114,213 a year',
       'From $93,496 a year', 'From $108,763 a year', '$70 - $85 an hour',
       '$100,000 - $130,000 a year', 'From $140,000 a year',
       '$110,000 - $135,000 a year', '$55,000 - $95,000 a year',
       '$75,200 a year', '$40 - $45 an hour', '$75,000 - $100,000 a year',
       '$55 - $75 an hour', '$93,389 - $147,614 a year',
       '$125,500 a year', '$75,100 a year', 'From $80,000 a year',
       '$85,000 - $105,000 a year', '$61,727 a year',
       '$60,000 - $90,000 a year', '$78,692 - $104,923 a year',
       'From $93,870 a year', '$110,000 - $120,000 a year',
       '$140,000 - $160,000 a year', '$65 - $70 an hour',
       '$150,000 - $230,000 a year', '$65 - $68 an hour',
       '$75,000 - $85,000 a year', 'From $60 an hour',
       '$46 - $60 an hour', '$250,000 - $375,000 a year',
       '$90,000 - $130,000 a year', '$60 - $70 an hour',
       '$103,000 - $123,000 a year', '$97,289 - $244,229 a year',
       '$77.55 - $82.55 an hour', '$20 an hour', '$61 - $74 an hour',
       '$117,000 - $155,000 a year', '$200,000 - $300,000 a year',
       '$87,160 - $118,000 a year', '$206,000 - $251,000 a year',
       '$132,476 - $163,000 a year', '$190,000 a year',
       '$77,710 - $116,570 a year', '$130,000 - $170,000 a year',
       'From $200,000 a year', 'From $55,000 a year',
       '$76,075 - $175,319 a year', 'From $75,123 a year',
       '$42 - $52 an hour', '$70 - $75 an hour',
       '$3,470 - $6,681 a month', '$10 an hour',
       '$80,000 - $90,000 a year', '$5,325 - $10,533 a month',
       '$80,000 a year', '$76,721 - $99,741 a year',
       '$88,656 - $222,212 a year', '$89,115 - $222,451 a year',
       '$80,000 - $135,000 a year', '$17 - $20 an hour',
       '$121,162 - $200,000 a year', '$130,000 - $160,000 a year',
       '$125,000 - $180,000 a year', '$61 - $80 an hour',
       '$124,155 - $197,518 a year', '$84,468 - $97,138 a year',
       '$120,000 a year', '$140,000 - $170,000 a year',
       '$60 - $90 an hour', '$46.41 - $53.37 an hour',
       '$130,000 - $140,000 a year', '$130,000 - $190,000 a year',
       '$94,283 - $108,426 a year', '$200,000 a year',
       '$110,000 - $150,000 a year', '$100,000 - $125,000 a year',
       '$130,000 - $175,000 a year', '$215,000 a year',
       'From $100,000 a year', '$72 an hour', '$70 an hour',
       '$160,000 a year', '$60,000 - $65,000 a year', '$270,000 a year',
       '$220,000 a year', 'Up to $2,000 a month', 'From $123,000 a year',
       '$240,000 a year', '$150,000 a year', '$85,225 - $135,355 a year',
       '$75,688 - $149,805 a year', '$185,000 a year', '$25.57 an hour',
       '$85,000 - $115,000 a year', '$100,000 - $160,000 a year',
       '$140,000 - $150,000 a year', '$70,000 - $90,000 a year',
       '$38 - $48 an hour', '$45 - $50 an hour',
       '$107,807 - $140,146 a year', '$95,000 - $125,000 a year',
       '$190,000 - $210,000 a year', '$110,000 - $170,000 a year',
       '$76,228 - $162,994 a year', '$60 - $65 an hour',
       '$120,000 - $160,000 a year', '$70,000 a year',
       '$122,530 - $159,286 a year', '$100,000 - $170,000 a year',
       '$105,000 - $150,000 a year', '$90,000 - $150,000 a year',
       '$96,516 - $135,395 a year', '$55,000 - $65,000 a year',
       '$76,010 - $120,000 a year', '$125,000 - $150,000 a year',
       '$102,663 - $142,958 a year', '$175,000 - $190,000 a year',
       '$75,000 - $140,000 a year', '$75,000 - $135,000 a year',
       '$70,000 - $180,000 a year', '$147,874 - $251,385 a year',
       '$125,000 a year', '$49,157 - $94,581 a year',
       '$79,521 - $90,000 a year', 'From $75,000 a year',
       '$100,319 - $152,137 a year', '$92,211 - $169,987 a year',
       '$102,663 - $133,465 a year', '$82,479 - $240,000 a year',
       '$63,503 - $157,709 a year', '$142,701 - $170,800 a year',
       '$73,973 - $112,240 a year', '$174,225 - $194,516 a year',
       '$150,000 - $190,000 a year', '$145,000 - $190,000 a year',
       '$131,239 - $197,300 a year', '$150,000 - $200,000 a year',
       '$51,102 - $81,263 a year', '$117,265 - $165,084 a year',
       '$155,000 - $160,000 a year', '$30 - $70 an hour',
       '$57,000 - $70,000 a year', '$80 - $100 an hour',
       '$125,000 - $300,000 a year', '$45 - $55 an hour',
       '$93,587 - $121,668 a year', '$250,000 a year',
       '$50 - $72 an hour', '$65,000 - $70,000 a year',
       '$150,000 - $180,000 a year', '$55,000 - $70,000 a year',
       '$32 - $37 an hour', '$68,400 - $80,000 a year',
       '$30 - $33 an hour', '$23 - $40 an hour', 'Up to $70 an hour',
       '$61,143 - $94,776 a year', '$30 - $37 an hour', '$40,000 a year',
       '$35 - $42 an hour', '$58,949 a year', '$47 - $50 an hour',
       '$15 an hour', '$40 - $43 an hour', '$80 - $90 an hour',
       '$40 - $50 an hour', '$60,000 - $80,000 a year', '$72,000 a year',
       '$85,000 - $90,000 a year', '$100,000 - $110,000 a year',
       '$102,000 - $115,000 a year', '$60 an hour',
       '$65,000 - $90,000 a year', '$25 - $28 an hour',
       '$48,000 - $55,000 a year', '$4,599 - $6,700 a month',
       '$3,763 - $6,149 a month', '$5,000 a month',
       'Up to $60,000 a year', '$42 - $72 an hour',
       '$48,728 - $103,038 a year', '$130,000 - $141,136 a year',
       '$74,000 - $96,000 a year', '$26.42 - $34.35 an hour',
       '$25 an hour', '$4,917 - $6,000 a month',
       '$4,917 - $6,489 a month', '$50,000 - $75,000 a year',
       '$4,599 - $6,066 a month', '$34 - $75 an hour',
       '$20 - $22 an hour', '$50 - $65 an hour', '$22 an hour',
       '$3,763 - $4,167 a month', '$4,301 - $7,040 a month',
       '$50 - $55 an hour', '$5,259 - $7,500 a month',
       '$4,917 - $7,084 a month', '$51,000 - $59,000 a year',
       '$65,902 a year', '$55 - $65 an hour', '$52,000 - $62,000 a year',
       '$31.47 - $40.91 an hour', '$45 - $65 an hour',
       '$5,500 - $7,000 a month', '$4,200 - $4,600 a month',
       '$31 - $40 an hour', '$56.68 an hour', '$22.96 - $29.72 an hour',
       'From $40,000 a year', '$21.72 - $29.90 an hour', '$85,000 a year',
       '$65,908 a year', 'From $35 an hour', '$70,000 - $80,000 a year',
       '$45,195 - $62,225 a year', '$30 - $42 an hour',
       '$16 - $18 an hour', '$66,980 - $96,568 a year',
       '$35.00 - $38.50 an hour', '$219 a day', '$30 - $40 an hour',
       '$56,318 - $128,570 a year', '$57,995 - $120,550 a year',
       '$50,000 a year', '$82,298 - $120,000 a year',
       '$65,000 - $75,000 a year', '$63,781 - $92,382 a year',
       '$60,000 - $70,000 a year', '$48,000 - $52,994 a year',
       '$20.94 an hour', '$35,000 - $40,000 a year', '$34 - $38 an hour',
       '$6,659 - $10,094 a month', '$50,000 - $60,000 a year',
       '$23.55 - $26.17 an hour', '$40,000 - $47,000 a year',
       '$26.45 an hour', '$4,284 - $6,270 a month', '$22 - $33 an hour',
       '$52,649 - $58,893 a year', '$28 an hour',
       '$86,500 - $132,000 a year', '$35 - $38 an hour',
       '$57,141 - $128,101 a year', '$59.00 - $59.60 an hour',
       '$55 - $60 an hour', '$26 - $30 an hour', '$48.80 an hour',
       '$46.12 an hour', '$60,000 - $100,000 a year', '$18 an hour',
       '$50,000 - $80,000 a year', '$50,000 - $65,000 a year',
       '$15 - $18 an hour', '$64,214 - $121,425 a year',
       '$43,251 - $56,222 a year', '$62,700 - $94,050 a year',
       '$59,322 - $88,983 a year', '$84,000 - $126,000 a year',
       '$35 - $45 an hour', '$50 an hour', '$31.76 an hour',
       '$29.16 an hour', '$26.44 - $31.25 an hour', '$38 an hour',
       '$62,000 a year', '$47 - $60 an hour', '$70,000 - $100,000 a year',
       '$21.81 an hour', '$27.96 an hour', 'From $20 an hour',
       '$48,371 - $64,000 a year', '$27 - $35 an hour',
       '$22 - $26 an hour', '$70,435 - $90,853 a year',
       '$72,000 - $95,000 a year', '$97,700 a year',
       '$58,965 - $115,999 a year', '$76,031 a year',
       '$94,300 - $175,100 a year', '$135,000 - $165,000 a year',
       '$67,461 - $128,008 a year', '$54,004 - $108,219 a year',
       '$54,178 - $108,672 a year', '$65,000 a year', '$35 - $36 an hour',
       '$54,882 - $108,001 a year', '$39 - $64 an hour',
       '$55,851 - $107,266 a year', '$35 - $40 an hour', '$45,914 a year',
       '$85,680 - $117,484 a year', '$51,599 - $63,982 a year',
       '$75,000 - $106,163 a year', '$63,048 - $77,058 a year',
       '$90,000 - $100,000 a year', '$85,000 - $98,000 a year',
       '$86,528 a year', '$50 - $75 an hour', '$90,000 a year',
       '$120,000 - $125,000 a year', '$58,500 - $81,800 a year',
       '$39.01 - $58.52 an hour', '$75,000 - $80,000 a year',
       '$70,000 - $115,000 a year', '$64,000 - $84,000 a year',
       '$73,415 - $87,960 a year', '$29.54 an hour', '$43,200 a year',
       '$53,557 - $71,409 a year', '$50 - $54 an hour',
       '$80,149 - $106,866 a year', '$55,800 a year',
       '$62,400 - $78,000 a year', '$77,300 - $100,000 a year',
       '$71,500 - $97,000 a year', '$55,000 a year',
       '$33,000 - $36,500 a year', '$65,373 - $117,589 a year',
       '$56,000 - $76,000 a year', '$40,000 - $45,000 a year',
       '$32,703 - $51,904 a year', '$20.90 - $24.20 an hour',
       '$110,000 - $130,000 a year', '$58,000 - $62,000 a year',
       '$55,000 - $75,000 a year', '$53,118 - $95,612 a year',
       '$51,246 - $79,424 a year', '$38 - $40 an hour', '$53.33 an hour',
       '$31,775 - $60,684 a year', '$26 - $31 an hour',
       '$60,684 - $128,603 a year', '$5,875 - $6,505 a month',
       'Up to $85,000 a year', '$67,660 - $82,695 a year',
       '$50 - $60 an hour', '$75,000 - $90,000 a year',
       '$102,770 - $154,150 a year', '$68,602 - $131,065 a year',
       '$30 an hour', '$65 - $90 an hour', '$71,200 - $128,300 a year',
       '$60 - $75 an hour', '$65,180 - $84,732 a year',
       '$44.61 - $56.11 an hour', '$105,000 - $135,000 a year',
       '$112,400 - $146,120 a year', '$78,400 - $121,600 a year',
       '$105,000 - $115,000 a year', '$42 - $84 an hour',
       'Up to $3,000 a month', '$145,000 - $150,000 a year',
       '$99,694 - $124,634 a year', '$9,532 - $11,913 a month',
       '$3,897 a month', '$165,000 a year', '$51.64 - $64.96 an hour',
       '$32 - $42 an hour', '$40 - $55 an hour',
       '$62,000 - $72,000 a year', '$14 - $16 an hour',
       '$113,000 - $127,000 a year', '$42,244 - $80,137 a year',
       '$25.53 an hour', '$54,995 a year', '$23 - $25 an hour',
       'Up to $40 an hour', 'Up to $15 an hour',
       '$92,143 - $119,787 a year', '$77,931 - $120,475 a year',
       '$45,152 - $86,876 a year', '$19 - $20 an hour',
       '$64,000 - $74,000 a year', '$27 - $33 an hour',
       '$20,000 - $40,000 a year', '$36.47 - $46.21 an hour',
       '$55,778 - $87,161 a year', '$31,200 a year', '$32,000 a year',
       '$24 - $26 an hour', '$58,139 - $84,302 a year',
       '$40 - $65 an hour', '$24 - $29 an hour',
       '$55,000 - $80,000 a year', '$82,285 a year',
       '$75,243 - $117,572 a year', '$47,000 a year',
       '$73,096 - $95,023 a year', '$6,334 - $12,516 a month',
       '$84,714 - $138,575 a year', '$95,000 - $100,000 a year',
       '$22.10 an hour', '$70,800 - $90,624 a year',
       'From $71,322 a year', '$35 - $55 an hour',
       '$64,649 - $84,049 a year', '$59,592 - $82,472 a year',
       '$59,280 - $67,600 a year', '$30 - $35 an hour',
       '$44 - $73 an hour', '$21 - $35 an hour',
       '$54,100 - $83,981 a year', '$73,962 - $115,251 a year',
       'From $65,000 a year', '$35.24 an hour', 'Up to $30 an hour',
       '$52,000 a year', '$64,140 - $77,609 a year',
       '$64,140 - $70,554 a year', '$56,736 - $128,001 a year',
       'Up to $45 an hour', '$58,100 a year', '$84,468 - $104,909 a year',
       '$75,504 - $86,830 a year', '$46.41 - $56.11 an hour',
       '$64,175 - $100,000 a year', '$50,000 - $55,000 a year',
       '$55,473 - $68,898 a year', '$33.84 - $42.03 an hour',
       '$81,000 - $105,000 a year', '$50 - $90 an hour',
       '$36,812 - $84,395 a year', '$56,548 - $72,000 a year',
       '$85,500 - $104,500 a year', '$84,468 - $111,003 a year',
       '$53,956 - $60,558 a year', '$65,000 - $85,000 a year',
       '$75 - $85 an hour', '$65,000 - $80,000 a year',
       '$66,603 - $68,750 a year', '$35,000 - $50,000 a year',
       '$123,552 a year', 'Up to $75,000 a year',
       '$45,000 - $55,000 a year', '$50,074 - $124,185 a year',
       'From $30 an hour', '$55,732 - $128,154 a year',
       '$29 - $50 an hour', '$73,000 a year', '$65 - $75 an hour',
       'Up to $80,000 a year', 'Up to $51,714 a year',
       '$70,000 - $89,000 a year', '$50.34 an hour',
       '$75,000 - $130,000 a year', '$95,000 - $110,000 a year',
       '$20 - $45 an hour', '$105,000 - $110,000 a year',
       'Up to $110,000 a year', '$53.08 an hour',
       '$55,960 - $145,219 a year', '$57,833 - $127,355 a year',
       '$104,000 a year', '$45,000 - $100,000 a year',
       '$69,000 - $71,000 a year', '$66,043 - $85,000 a year',
       '$5,283 - $8,592 a month', '$21.64 an hour',
       '$42,000 - $45,000 a year', '$25 - $30 an hour',
       '$72,000 - $75,850 a year', '$29.50 - $37.00 an hour',
       'Up to $66.02 an hour', '$80,000 - $95,000 a year',
       '$102,104 - $132,739 a year', '$83,250 - $90,000 a year',
       '$75 - $86 an hour', '$46.13 - $50.86 an hour',
       'Up to $123,000 a year', '$8,256 - $10,572 a month',
       '$80 - $98 an hour', '$90,000 - $95,000 a year',
       '$58,146 - $107,195 a year', 'Up to $60 an hour',
       '$60,000 - $125,000 a year', '$53,582 - $101,336 a year',
       '$44 - $50 an hour', '$33.86 - $38.94 an hour',
       '$109,223 - $114,753 a year', '$37.45 - $43.62 an hour',
       '$75,000 - $110,000 a year', '$52.92 - $61.65 an hour',
       '$34.80 - $47.18 an hour', '$57,955 - $91,155 a year',
       '$40,000 - $60,000 a year', '$99,736 - $120,744 a year',
       '$50,000 - $70,000 a year', '$13 an hour',
       '$120,000 - $130,000 a year', '$20 - $30 an hour',
       '$88,546 a year', '$94,858 - $122,227 a year',
       '$55,000 - $100,000 a year', '$107,000 - $124,000 a year',
       '$72,750 - $94,581 a year', '$63,000 - $73,000 a year',
       '$30 - $32 an hour', '$52,620 - $64,314 a year',
       '$85 - $95 an hour', '$58,893 - $99,399 a year',
       '$61,521 - $79,314 a year', '$60,129 - $94,581 a year',
       '$47,421 - $75,408 a year', '$87,198 - $113,362 a year',
       '$60,129 - $113,362 a year', '$56,376 - $106,553 a year',
       '$60,129 - $78,167 a year', '$79,000 - $108,000 a year',
       'From $120,000 a year', '$65,000 - $130,000 a year',
       '$58,000 a year', '$140,000 - $200,000 a year',
       '$67 - $70 an hour', 'Up to $100,000 a year', '$47 - $96 an hour',
       '$43.55 an hour', '$125,000 - $135,000 a year',
       '$86,335 - $133,465 a year', '$122,530 - $172,500 a year',
       '$40 - $42 an hour'], dtype=object)

In [176]:
salaries_only_df = df[~df['salary'].isnull()]
salaries_only_df.shape

(1263, 10)

**We have more than 1200 jobs data jobs related postings that include salary**

## 3. Data Preprocessing

### Salary Feature Engineering

#### Salary by rate type

Above we see many types of salary descriptions that can be overwhelming to analyze for later. Let's simplify things a bit.

In [177]:
def rate_by_func(col):
    """
    Function made to manipulate salary description in order to turn it into a salary rate type
    """
    temp = ""
    if "year" in str(col):
        temp = "Yearly"
    elif "month" in str(col):
        temp = 'Monthly'
    elif "week" in str(col):
        temp = 'Weekly'
    elif "day" in str(col):
        temp = "Daily"
    elif "hour" in str(col):
        temp = "Hourly"
    else:
        temp = col
    return temp

In [178]:
salaries_only_df['rate_by'] = salaries_only_df['salary'].apply(rate_by_func)

/Users/cristobalza/opt/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [179]:
salaries_only_df['rate_by'].value_counts()

Yearly           794
Hourly           428
Monthly           36
$40 per class      3
Daily              1
Weekly             1
Name: rate_by, dtype: int64

In [180]:
salaries_only_df[salaries_only_df['salary'] == "$40 per class"]

,job_title,salary,company,location,is_remote,job_rating,job_summary,post_date,extract_date,job_url,rate_by
7,Data Scientist,$40 per class,Harvard University,"Boston, MA",NaN,4.3,"Furthermore, they will develop new data analys...",30+ days ago,2021-01-10,https://www.indeed.com/rc/clk?jk=349a3652ec146...,$40 per class
10,Data Scientist / Engineer,$40 per class,Harvard University,"Boston, MA",NaN,4.3,We are especially interested in candidates wit...,30+ days ago,2021-01-10,https://www.indeed.com/rc/clk?jk=f51201ad681b4...,$40 per class
238,Statistical Analyst/Programmer,$40 per class,Harvard University,"Boston, MA",NaN,4.3,"Chan School of Public Health, is responsible f...",30+ days ago,2021-01-10,https://www.indeed.com/rc/clk?jk=37ef1e8ffb58e...,$40 per class

Some job postings had educational purpose. Since the number is very low, those jobs will be excluded.

In [181]:
salaries_only_df = salaries_only_df[salaries_only_df['salary'] != "$40 per class"]
salaries_only_df.shape

(1260, 11)

In [199]:
salaries_only_df[salaries_only_df['rate_by'] == "Weekly"]

,job_title,salary,company,location,is_remote,job_rating,job_summary,post_date,extract_date,job_url,rate_by,min,max,adjusted_salary
146,Data Science Program Director,"$1,350 a week",National Student Leadership Conference,"Atlanta, GA",NaN,4.6,Program is a 9-day educational conference prov...,27 days ago,2021-01-10,https://www.indeed.com/company/National-Studen...,Weekly,1350.0,0.0,1350.0

#### Max and min

In [183]:
salaries_only_df[['min', 'max']] = salaries_only_df['salary'].str.split('-', expand = True)

In [184]:
salaries_only_df[['min', 'max']]

                       min               max
3    Up to $120,000 a year              None
8                     $60        $80 an hour
19                    $35        $50 an hour
23                $92,000    $108,000 a year
24                    $60       $100 an hour
..                     ...               ...
250               $86,335    $133,465 a year
253              $122,530    $172,500 a year
281               $80,000     $89,000 a year
282         $70,000 a year              None
284                   $40        $42 an hour

[1260 rows x 2 columns]

#### Extract digits using `regex`

In [185]:
example = "$50,000 - $70,000 a year"
pattern = '\$[0-9]*[.,]?[0-9]*'
p = re.compile(pattern)
digits = p.findall(example)
digits

['$50,000', '$70,000']

In [194]:
def extract_digits_func(description):
    """
    Cleans string value Series using Regex. Only keeps digits
    """
    if description:
        pattern = '\$[0-9]*[.,]?[0-9]*'
        p = re.compile(pattern)
        digits = p.findall(description)
        temp_1 = digits[0].replace("$","")
        temp_2 = temp_1.replace(",","")
        
        return float(temp_2)
    else:
        return 0

In [190]:
# List of all unique possible salary options
salary_unique_list = salaries_only_df['salary'].unique()

In [191]:
salaries_only_df['min'] = salaries_only_df['min'].apply(extract_digits_func)

In [192]:
salaries_only_df['max'] = salaries_only_df['max'].apply(extract_digits_func)

In [193]:
salaries_only_df[['min', 'max']]

          min       max
3    120000.0       0.0
8        60.0      80.0
19       35.0      50.0
23    92000.0  108000.0
24       60.0     100.0
..        ...       ...
250   86335.0  133465.0
253  122530.0  172500.0
281   80000.0   89000.0
282   70000.0       0.0
284      40.0      42.0

[1260 rows x 2 columns]

In [195]:
def average_func(a, b):
    """
    Calculate average
    """
    adjusted_salary=[]
    for x, y in zip(a,b):
        if y > 0:
            avg_salary = (x+y)/2
        else:
            avg_salary = x
        adjusted_salary.append(avg_salary)
    return adjusted_salary

In [200]:
a = salaries_only_df['min']
b = salaries_only_df['max']
salaries_only_df['adjusted_salary'] = average_func(a, b)

In [201]:
salaries_only_df[['adjusted_salary']]

     adjusted_salary
3           120000.0
8               70.0
19              42.5
23          100000.0
24              80.0
..               ...
250         109900.0
253         147515.0
281          84500.0
282          70000.0
284             41.0

[1260 rows x 1 columns]

According to the U.S. Bureau

In [ ]:
def yearly_salaries_func(rates,salaries_num):
    """
    Put all salaries in terms of Yearly salary.
    For example to calculate  the 
    """
    adjusted_yearly_salary = []
    for r, salary_num in zip(rates,salaries_num):
        if r == "Yearly":
            # salary_num
            yearly_salary = salary_num
        elif r == "Monthly":
            # salary * 12 months
            yearly_salary = salary_num*12
        elif r == "Daily":
            # salary * weekdays * 52 weeks of the year
            yearly_salary = salary_num*5*52  
        elif r == "Hourly":
            # salary * hours worked * 52 weeks of the year
            yearly_salary = salary_num*40*52
        elif r == 'Weekly':
            yearly_salary = salary_num
        adjusted_yearly_salary.append(yearly_salary)
    return adjusted_yearly_salary